docs/friday_june20.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>friday<sub>june20</sub></title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-06-20 13:30:27 IST"/>
<meta name="author" content="sai krishna sripada"/>
</head><body>
<h1 class="title">friday<sub>june20</sub></h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Work done </a></li>
<li><a href="#sec-2">2 Challenges </a></li>
<li><a href="#sec-3">3 Future work </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 Work done </h2>
<div id="text-1">


<ul>
<li>
 TDD using nosetests framework
<ul>
<li>
 Install nosetests: 



<pre class="example">
pip install nose
</pre>



</li>
<li>
 Running Tests:



<pre class="example">
nosetests imagescripttest.py
</pre>



</li>
<li>
Running Tests to capture stdout and strerr also



<pre class="example">
nosetests --nocapture imagescripts.py
</pre>



</li>
<li>
 Sample nosetests code:
<ul>
<li>
 import unittest module



<pre class="example">
import unittest
</pre>



</li>
<li>
 unittest class should inherit unittest.TestCase class



<pre class="example">
class TddInPython(unittest.TestCase):
</pre>



</li>
<li>
 all test cases should begin with test_ prefix.



<pre class="example">
def test_get_image_list(self):
</pre>



</li>
<li>
 code:



<pre class="example">
import unittest
from imagescript import imageos

class TddInPython(unittest.TestCase):
    def test_get_image_list(self):
        adapter = imageos()
        prev_image_list = adapter.get_image_list()
        assert("test" not in prev_image_list)
        print prev_image_list
        print ("\n")
        image = adapter.create_image("test")
        print ("\n")
        cur_image_list = adapter.get_image_list()
        assert(image.name in cur_image_list)
        print cur_image_list
        print ("\n")
        adapter.delete_image("test")
        new_image_list = adapter.get_image_list()
        print new_image_list
        assert("test" not in new_image_list)
        print ("\n")
        print "get_image_list() function passed"
</pre>




</li>
</ul>
</li>
</ul>
</li>
<li>
 Develop adapter with using Object oriented programming in python

<ul>
<li>
 Classes for image handling, flavor handling, VM handling and VM details
<ul>
<li>
 sample coding guidelines followed:
<ul>
<li>
 Used object oriented style of coding



<pre class="example">
class imageos(object):
</pre>



</li>
<li>
 Docstrings are present to descibe each and every procedure



<pre class="example">
        """
        Create an image.

        :param image: The name of the image to get.
        :rtype: :json: image details
        """
</pre>



</li>
<li>
 Common global variables are handled with @classmethod directive



<pre class="example">
class imageos(object):
    creds = get_keystone_creds()
    keystone = ksclient.Client(**creds)

    @classmethod
    def create_image(cls,name):
        glance_endpoint = cls.keystone.service_catalog.url_for(service_type='image', endpoint_type='publicURL')
</pre>



</li>
<li>
 code:



<pre class="example">
class imageos(object):

    creds = get_keystone_creds()
    keystone = ksclient.Client(**creds)
    creds1 = get_nova_creds()
    nova = nvclient.Client(**creds1)
                
    @classmethod
    def create_image(cls,name):
        """
        Create an image.

        :param image: The name of the image to get.
        :rtype: :json: image details
        """
        glance_endpoint = cls.keystone.service_catalog.url_for(service_type='image', endpoint_type='publicURL')
        glance = glanceclient.Client('1', endpoint=glance_endpoint, token=cls.keystone.auth_token)

        with open('/home/cloud/Downloads/precise-server-cloudimg-amd64-disk1.img', 'rb') as fimage:
            image = glance.images.create(name=name, is_public=True, disk_format="qcow2", container_format="bare", data=fimage)
            return image
</pre>




</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2 Challenges </h2>
<div id="text-2">

<ul>
<li>
 We have installed openstack server on a VM with 30G hdd space. So once the hdd space is used up by the openstack server, it crached and we will have to re-install the openstack from scratch.
</li>
<li>
 Figuring the usage of nosetests
</li>
<li>
 Using the "@classmethod" directive of python
</li>
<li>
 SSH to vm
<ul>
<li>
 Still facing issues
</li>
<li>
 cannot login to the vm created on openstack from outside world. &ndash; Issuing floating IP functionality needs to be figured out.
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">3 Future work </h2>
<div id="text-3">

<ul>
<li>
 Solve the SSH issue.
</li>
<li>
 Install the required packages for labs and copying of VMManager and Running VMManager server should be automated along with the vm creation module
</li>
<li>
 complete the conversion of adapter code to Object oriented

</li>
</ul>
</div>
</div>
<div id="postamble"><p class="author"> Author: sai krishna sripada
<a href="mailto:saikrishna@localhost.localdomain">&lt;saikrishna@localhost.localdomain&gt;</a>
</p>
<p class="date"> Date: 2014-06-20 13:30:27 IST</p>
<p>HTML generated by org-mode 6.21b in emacs 23</p>
</div></body>
</html>
